Revit 2027 API
PDFExportOptions.ZoomType Property
 Zoom type of either fit to page or on a specific percentage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoomType ZoomType { get; set; }
Public Property ZoomType As ZoomType
	Get
	Set
public:
property ZoomType ZoomType {
	ZoomType get ();
	void set (ZoomType value);
}
member ZoomType : ZoomType with get, set
Property Value
ZoomType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This property would be ignored if the PaperFormat is Default.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace